<a href="https://colab.research.google.com/github/ALENKOZAVR/Pr_IS_01/blob/main/Untitled4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [29]:
import pandas as pd
import numpy as np
from IPython.display import display

# data import

In [30]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header = None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [31]:
names = ['ID','RI','Na','Mg','Al','Si','K','Ca','Ba','Fe','Class']
data.columns = names
data = data.drop(columns=['ID'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [32]:
data['Class'].replace({
    1: "building_float",
    2: "building_non_float",
    3: "vehicle_float",
    4: "vehicle_non_float",
    5: "containers",
    6: "tableware",
    7: "headlamps"},
    inplace=True)
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float

In [33]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan
data.head(5)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  building_float
2  1.51618  13.53  3.55   NaN  72.99  0.39  7.78  0.0  0.0  building_float
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0  building_float
4  1.51742  13.27   NaN  1.24  73.08  0.55  8.07  0.0  0.0  building_float

# data visualisation

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      203 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      201 non-null    float64
 4   Si      201 non-null    float64
 5   K       203 non-null    float64
 6   Ca      201 non-null    float64
 7   Ba      201 non-null    float64
 8   Fe      201 non-null    float64
 9   Class   195 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [35]:
data.describe()

               RI          Na         Mg  ...          Ca          Ba          Fe
count  199.000000  203.000000  195.00000  ...  201.000000  201.000000  201.000000
mean     1.518415   13.415320    2.65559  ...    8.974179    0.175672    0.054677
std      0.003086    0.827714    1.45704  ...    1.461702    0.500859    0.097612
min      1.511150   10.730000    0.00000  ...    5.430000    0.000000    0.000000
25%      1.516550   12.915000    1.98500  ...    8.230000    0.000000    0.000000
50%      1.517680   13.310000    3.48000  ...    8.600000    0.000000    0.000000
75%      1.519170   13.875000    3.59500  ...    9.230000    0.000000    0.090000
max      1.533930   17.380000    4.49000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [41]:
display(data['Class'].describe())
print("=============================")
display(data["Class"].value_counts())

count                    195
unique                     6
top       building_non_float
freq                      71
Name: Class, dtype: object

=============================

building_non_float    71
building_float        67
headlamps             26
containers            13
vehicle_float         13
tableware              5
Name: Class, dtype: int64